## Production: dns
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 1 to add, 0 to change, 1 to destroy
```
<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_ses_receipt_rule.inbound-to-lambda will be destroyed
  # (because aws_ses_receipt_rule.inbound-to-lambda is not in configuration)
  - resource "aws_ses_receipt_rule" "inbound-to-lambda" {
      - arn           = "arn:aws:ses:us-east-1:296255494825:receipt-rule-set/main:receipt-rule/inbound-to-lambda" -> null
      - enabled       = true -> null
      - id            = "inbound-to-lambda" -> null
      - name          = "inbound-to-lambda" -> null
      - recipients    = [
          - "notification.canada.ca",
        ] -> null
      - rule_set_name = "main" -> null
      - scan_enabled  = true -> null
      - tls_policy    = "Optional" -> null

      - lambda_action {
          - function_arn    = "arn:aws:lambda:us-east-1:296255494825:function:ses-receiving-emails" -> null
          - invocation_type = "Event" -> null
          - position        = 1 -> null
        }
    }

  # aws_ses_receipt_rule.ses_receiving_emails_inbound-to-lambda-arn will be created
  + resource "aws_ses_receipt_rule" "ses_receiving_emails_inbound-to-lambda-arn" {
      + arn           = (known after apply)
      + enabled       = true
      + id            = (known after apply)
      + name          = "ses_receiving_emails_inbound-to-lambda"
      + recipients    = [
          + "notification.canada.ca",
        ]
      + rule_set_name = "main"
      + scan_enabled  = true
      + tls_policy    = (known after apply)

      + lambda_action {
          + invocation_type = "Event"
          + position        = 1
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.assets-notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.notification-canada-ca-alt[0]"]

20 tests, 17 passed, 3 warnings, 0 failures, 0 exceptions

```

</details>
